Table of Contents
 Class ProgressSender
Namespace
IdeaStatiCa.Plugin
Assembly
IdeaStatiCa.Plugin.dll
public class ProgressSender : ClientBase<IProgressCallback>, ICommunicationObject, IDisposable, IProgressCallback
Inheritance
object
ClientBase<IProgressCallback>
ProgressSender
Implements
ICommunicationObject
IDisposable
IProgressCallback
Inherited Members
 ClientBase<IProgressCallback>.GetDefaultValueForInitialization<T>()
 ClientBase<IProgressCallback>.Open()
 ClientBase<IProgressCallback>.Abort()
 ClientBase<IProgressCallback>.Close()
 ClientBase<IProgressCallback>.DisplayInitializationUI()
 ClientBase<IProgressCallback>.CreateChannel()
 ClientBase<IProgressCallback>.InvokeAsync(ClientBase<IProgressCallback>.BeginOperationDelegate, object[], ClientBase<IProgressCallback>.EndOperationDelegate, SendOrPostCallback, object)
 ClientBase<IProgressCallback>.Channel
 ClientBase<IProgressCallback>.CacheSetting
 ClientBase<IProgressCallback>.ChannelFactory
 ClientBase<IProgressCallback>.ClientCredentials
 ClientBase<IProgressCallback>.State
 ClientBase<IProgressCallback>.InnerChannel
 ClientBase<IProgressCallback>.Endpoint
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Constructors
 ProgressSender(string)
public ProgressSender(string id)
Parameters
id string
Properties
 Service
protected IProgressCallback Service { get; }
Property Value
IProgressCallback
Methods
 ExceptionMessage(string, Exception)
Method is called when an exception occurs on the server.
public void ExceptionMessage(string function, Exception exception)
Parameters
function string
Name of the method.
exception Exception
Details of the exception
 IterationMessage(double, string, string)
infomation about progress of event.
public void IterationMessage(double percent, string message, string iteration)
Parameters
percent double
percentage of event status
message string
message
iteration string
Number of the iteration (FEM solver steps)
 ProgressMessage(double, string)
infomation about progress of event.
public void ProgressMessage(double percent, string message)
Parameters
percent double
percentage of event status
message string
message
 Edit this page